{
    "information":{
        "characterName": "NightBlood (James)",
        "classLevel": "Warlock 6 / Rouge 2",
        "race": "Half- Dragon",
        "background": "Haunted One",
        "alignment": "Chaotic Good",
        "playerName": "Ya Boi",
        "xpPoints": "34,000"
    },
    "playStats":{ 
        "AC":"20", 
        "initiative":"+4", 
        "speed":"30", 
        "hitdice":"8d8+2", 
        "maxHP":"70", 
        "tempHP":"0", 
        "currentHP":"21"
    },
    "abilitiesSkills":{
        "pbonus": "+3", 
        "str": "15", 
        "strmod": "+2", 
        "dex": "19", 
        "dexmod": "+4",
        "con": "14", 
        "conmod": "+2",
        "int": "11", 
        "intmod": "+0",
        "wis": "08", 
        "wismod": "-1",
        "cha": "20", 
        "chamod": "+5",
        "prof":{
            "strsave": 1,
            "athletics": 0,
            "dexsave": 1,
            "acrobatics": 0,
            "sofhand": 1,
            "stealth": 2,
            "userope": 0,
            "consave": 1,
            "brewing": 0,
            "intsave": 1,
            "arcana": 0,
            "lore": 1,
            "investigate": 1,
            "nature": 0,
            "religion": 0,
            "appraisal": 0,
            "wissave": 1,
            "animialhand": 0,
            "insight": 0,
            "medicine": 0,
            "perception": 0,
            "survival": 1,
            "chasave": 1,
            "deception": 2,
            "intimidation": 1,
            "performance": 0,
            "persuasion": 0
        }
    },
    "money":{
        "cp":"200",
        "sp":"90",
        "gp":"3340",
        "pp":"3"
    },
    "actions":[
        {"name":"Nightblood","hitdc":"+8","effect":"1d8+5","desc":"Piercing"},
        {"name":"Eldritch Blast","hitdc":"+9","effect":"1d10+5","desc":"120Ft Force"},
        {"name":"Breath Weapon","hitdc":"13","effect":"3d6","desc":"15Ft Fire"},
        {"name":"Sneak Attack","hitdc":"+0","effect":"+1d6","desc":"On advantage"}
    ],
    "profs":{
        "armours":"Light Armor, Medium Armor, Shields",
        "weapons":"Martial Weapons, Simple Weapons",
        "languages":"Abyssal, Common, Draconic, Elvish, Thieves’ Cant",
        "tools":"Thieves' Tools"
    },
    "feats":[
        {"name":"War Caster","shorttxt":"Adv.. on Constitution saving throws.\nSomatic components with shield/weapons.\nReaction to cast a spell.","desc":"You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits\n\nYou have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.\nYou can perform the somatic components of spells even when you have weapons or a shield in one or both hands.\nWhen a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature."},
        {"name":"Blood Hound","shorttxt":"Aware of creatures within 10 feet of you on movement.\nNo disadvantage against invisible creatures that you are aware of.\nAdvantage on Perception and Survival checks that rely on sound or smell.","desc":"Your keen senses are heightened beyond that of most people. Whether these senses were heightened through training, through the loss of other senses, or they simply matured as you did, you gain the following benefits:\n\nWhile conscious, whenever a creature that is small or larger moves, within 10 feet of you, you immediately become aware of its presence.\nYour attack rolls do not have disadvantage against invisible creatures that you are aware of.\nYou have advantage on Wisdom (perception) and Wisdom (survival) checks that rely on sound or smell"}
    ],
    "classfeats":{
        "subname":"FluxBlade",
        "abilities":[
            {"Name":"Flux Jump","lvl":"1", "shorttxt":"1,6,10 lvl : 1,2,3 uses \nResets on a short rest.","desc":"At 1st level, You can cast the misty step spell once using this trait, this increases this increases to two at 6th and three times at 10th. You regain the ability to do so when you finish a short or long rest. "},
            {"Name":"Gate crawler","lvl":"6", "shorttxt":"Travel past teleportation traces inside of 120ft and no older than a day. \n d20+prof vs 12 + spell lvl - count = prof mod. \n Others can join you equel to the number of flux jumps left.","desc":"At 6th level, you gain the ability to detect the traces left by teleportation. As an action, you detect the distance and direction to any traces within 120 feet of you. However, if magic obscures any details of a portal or if the trace is older than a day, this feature doesn’t reveal them. If a trace is found, using the flux warriors weapon they can make a check plus proficiency mod to reopen or utilize the the trace. The DC to do this is based on the the level of the spell used.(12 + spell level) this can be done as many times equal to prof mod. Others can come with you through the trace equal to the number of flux jump charges."},
            {"Name":"Blink Strike","lvl":"10", "shorttxt":"On attack, 10 feet tp.\n If 2 enemys are hit then hit a 3rd","desc":"At 10th level, you gain the ability to pass between the planes in the blink of an eye.\nWhen you take the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.\nIf you attack at least two different creatures with the action, you can make one additional attack with it against a third creature."},
            {"Name":"Nope Step","lvl":"14", "shorttxt":"Reaction to being hit: tp 60ft and invisible.\nInvisiblity lasts till end of next turn or you attack. \nRecharged on short rest.","desc":"At 14th level, you have the ability to slip away from your foes. Immediately after you are hit by an attack, you can use your reaction to turn invisible and teleport up to 60 feet to a spot you can see. You remain invisible until the end of your next turn or until you attack, deal damage, or force a creature to make a saving throw. Once you use this feature, you must finish a short or long rest before you can use it again."}
        ]
    }
}