{
    "information": {
        "characterName": "Jezrien (DayBreak)",
        "classLevel": "Warlock 10",
        "totalLevels": 10,
        "race": "Half- Dragon",
        "background": "Haunted One",
        "alignment": "Chaotic Good",
        "playerName": "Ya Boi",
        "xpPoints": "34,000"
    },
    "playStats": {
        "AC": "21",
        "initiative": "+4",
        "speed": "30",
        "hitdice": "10d8+2",
        "maxHP": "84",
        "tempHP": "0",
        "currentHP": "84"
    },
    "abilitiesSkills": {
        "pbonus": "+3",
        "str": "15",
        "strmod": "+2",
        "dex": "19",
        "dexmod": "+4",
        "con": "14",
        "conmod": "+2",
        "int": "11",
        "intmod": "+0",
        "wis": "08",
        "wismod": "-1",
        "cha": "20",
        "chamod": "+5",
        "prof": {
            "strsave": 0,
            "athletics": 0,
            "dexsave": 0,
            "acrobatics": 0,
            "sofhand": 2,
            "stealth": 1,
            "userope": 0,
            "consave": 0,
            "brewing": 0,
            "intsave": 0,
            "arcana": 0,
            "lore": 1,
            "investigate": 1,
            "nature": 0,
            "religion": 0,
            "appraisal": 0,
            "wissave": 1,
            "animialhand": 0,
            "insight": 0,
            "medicine": 0,
            "perception": 0,
            "survival": 0,
            "chasave": 1,
            "deception": 1,
            "intimidation": 0,
            "performance": 0,
            "persuasion": 1
        }
    },
    "money": {
        "cp": "200",
        "sp": "90",
        "gp": "3340",
        "pp": "3"
    },
    "profs": {
        "armours": "Light Armor, Medium Armor, Shields",
        "weapons": "Martial Weapons, Simple Weapons  |  Thieves' Tools",
        "languages": "Abyssal, Common, Draconic, Elvish, Thieves’ Cant",
        "senses": "220ft Sight in magical and non-magical Darkness"
    },
    "actions": {
        "attack": [
            {
                "name": "DayBreak",
                "hitdc": "+11",
                "effect": "---",
                "desc": "Dagger 2d4 | Shortsword 2d6 | Longsword* 2d8/2d10 | Greatsword* 3d6"
            },
            {
                "name": "Eldritch Blast",
                "hitdc": "+12",
                "effect": "3d10+5",
                "desc": "Mellee Cold"
            },
            {
                "name": "Flux Curse",
                "hitdc": "---",
                "effect": "2d6",
                "desc": "Bonus act / rest / Proc on Hit"
            }
        ],
        "bonus": [
            {
                "name": "Cunning Action",
                "desc": "Dash, Disengage, or Hide action."
            },
            {
                "name": "Flux Curse",
                "desc": "2d6 Cold on hit. Once per rest"
            },
            {
                "name": "Flux Curse TP",
                "desc": "Swap position with curse target."
            },
            {
                "name": "Dragonic Scale Mail",
                "desc": "Don and doff armor."
            }
        ],
        "reaction": [
            {
                "name": "Opportunity Attack",
                "desc": "If a creature moves out of your reach make a melee attack."
            },
            {
                "name": "Shield",
                "desc": "+5 bonus to AC."
            },
            {
                "name": "TP : 10 x 1/2 lvl",
                "desc": "If creature Closes in, Spotted and Spell Att. Rest"
            }
        ],
        "limited": [
            {
                "name": "Movement TP",
                "desc": "Movement speed to teleport instead of walking."
            },
            {
                "name": "Dragonic Aspect",
                "desc": "1/day, +2d8, 40ft fly speed, Size large"
            },
            {
                "name": "Dragonic Scale Mail",
                "desc": "1/day, Detect chromatic dragons 30 miles."
            },
            {
                "name": "Charming God Dragon",
                "desc": "As an action, you present your holy symbol, and each creature of your choice that can see or hear you within 30 feet of you must succeed on a Wisdom saving throw or be charmed by you until the end of your next turn or until the charmed creature takes any damage. You can also cause any of the charmed creatures to drop what they are holding when they fail the saving throw."
            }
        ]
    },
    "powers": {
        "caster": {
            "are": true,
            "type": "warlock:slotless",
            "spell0": {
                "value": 3,
                "max": 3
            },
            "spell1": {
                "value": 0,
                "max": 0
            },
            "spell2": {
                "value": 0,
                "max": 0
            },
            "spell3": {
                "value": 0,
                "max": 0
            },
            "spell4": {
                "value": 0,
                "max": 0
            },
            "spell5": {
                "value": 0,
                "max": 0
            },
            "spell6": {
                "value": 0,
                "max": 0
            },
            "spell7": {
                "value": 0,
                "max": 0
            },
            "spell8": {
                "value": 0,
                "max": 0
            },
            "spell9": {
                "value": 0,
                "max": 0
            },
            "pact": {
                "value": 0,
                "max": 2
            },
            "spelllist": {
                "spell0": [
                    {
                        "name": "Mage Hand",
                        "RangeArea": "30ft",
                        "components": "V,S",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "lift/move up to 4.5 KG",
                        "dur": "1 min",
                        "desc": "Ranged spell attack in the shape of crows",
                        "link": "https://5e.tools/spells.html#mage%20hand_phb"
                    },
                    {
                        "name": "Prestidigitation",
                        "RangeArea": "10ft",
                        "components": "V,S",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "Sensory effects / small objects",
                        "dur": "1 Hour",
                        "desc": "Minor magical trick",
                        "link": "https://5e.tools/spells.html#prestidigitation_phb"
                    },
                    {
                        "name": "Minor Illusion",
                        "RangeArea": "30ft",
                        "components": "S,M(a bit of fleece)",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "Yoru steppies",
                        "dur": "1 minute",
                        "desc": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.\n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nIf you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.\n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
                        "link": "https://5e.tools/spells.html#minor%20illusion_phb"
                    },
                    {
                        "name": "Thaumaturgy",
                        "RangeArea": "30ft",
                        "components": "V",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "lift/move up to 4.5 KG",
                        "dur": "1 min",
                        "desc": "Manifest a minor wonder",
                        "link": "https://5e.tools/spells.html#thaumaturgy_phb"
                    },
                    {
                        "name": "! Placebo",
                        "RangeArea": "Touch",
                        "components": "V,S",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "Decption Vs Insight",
                        "dur": "1 min",
                        "desc": "You touch a willing creature, and make a Charisma (Deception) check, conlested by a Wisdom (Insight) check of the creature you are touching, on a success, the target believes it has regained 5 hitpoints, and that it has been cured of any diseases inflicting it.",
                        "link": "https://www.reddit.com/r/UnearthedArcana/comments/eqgrcv/a_joke_cantrip_for_those_who_complain_there_are/"
                    },
                    {
                        "name": "Disguise Self",
                        "RangeArea": "Self",
                        "components": "V,S",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "Investigation Vs Spell DC",
                        "dur": "1 hour",
                        "desc": "You make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.\nTo discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
                        "link": "https://5e.tools/spells.html#disguise%20self_phb"
                    },
                    {
                        "name": "Speak with Animals",
                        "RangeArea": "Self",
                        "components": "V,S",
                        "cost": false,
                        "ritual": false,
                        "castingTime": "1 Action",
                        "effect": "Comprehend and Verbally communicate with beasts",
                        "dur": "10 min",
                        "desc": "You gain the ability to comprehend and verbally communicate with beasts for the duration. The knowledge and awareness of many beasts is limited by their intelligence, but at minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a beast to perform a small favor for you, at the DM's discretion.",
                        "link": "https://5e.tools/spells.html#speak%20with%20animals_phb"
                    }
                ],
                "spell1": [
                    {
                        "name": "Shield",
                        "RangeArea": "Self",
                        "components": "V,S",
                        "cost": true,
                        "ritual": false,
                        "castingTime": "1 Reaction",
                        "effect": "+5 bonus to AC on reaction.",
                        "dur": "1 round",
                        "desc": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
                        "link": "https://5e.tools/spells.html#shield_phb"
                    },
                    {
                        "name": "Distort Value",
                        "RangeArea": "Touch",
                        "components": "V",
                        "cost": true,
                        "ritual": false,
                        "castingTime": "1 Reaction",
                        "effect": "x2 or 1/2 value : Investigation Vs S.DC",
                        "dur": "Instant",
                        "desc": "You cast this spell on an object no more than 1 foot on a side, doubling the object's perceived value by adding illusory flourishes or polish to it, or reducing its perceived value by half with the help of illusory scratches, dents, and other unsightly features. Anyone examining the object can ascertain its true value with a successful Intelligence (Investigation) check against your spell save DC.",
                        "link": "https://5e.tools/spells.html#hellish%20rebuke_phb"
                    },
                    {
                        "name": "Comprehend Lang",
                        "RangeArea": "60 feet",
                        "components": "V,S",
                        "cost": false,
                        "ritual": true,
                        "castingTime": "1 Action",
                        "effect": "Literal meaning of any language.",
                        "dur": "1 round",
                        "desc": "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.\nThis spell doesn't decode secret messages in a text or a glyph, such as an arcane sigil, that isn't part of a written language.",
                        "link": "https://5e.tools/spells.html#magnify%20gravity_egw"
                    }
                ],
                "spell2": [],
                "spell3": [],
                "spell4": [],
                "spell5": [],
                "spell6": [],
                "spell7": [],
                "spell8": [],
                "spell9": []
            }
        },
        "ki": {
            "are": false
        },
        "psy": {
            "are": false
        }
    },
    "features": {
        "classfeats": {
            "subname": "FluxBlade",
            "5important": [
                "Flux Jump",
                "Gate crawler"
            ],
            "abilities": [
                {
                    "name": "The FluxBlade",
                    "lvl": "1",
                    "shorttxt": "By using the full amount of movement speed, you teleport there, provoking no attacks of opportunity.",
                    "desc": "Your Eldritch Blast and Warlock’s Curse deal cold damage, this attack must be completed with a melee strike and has reach. By using the full amount of movement speed, you teleport there, provoking no attacks of opportunity.\nYou gain proficiency with medium armor, shields, and martial weapons."
                },
                {
                    "name": "The Exchange",
                    "lvl": "1",
                    "shorttxt": "Bonus Action: Exchange positions with the cursed creature. Reaction: 10 x half your warlock level TP if creature aproches you, spot's you when hidden or targeted with a spell.",
                    "desc": "You can magically exchange positions with the cursed creature as a bonus action.\nIn addition, as a reaction to one of the following, you can teleport a number of feet equal to 10 x half your warlock level (rounded down, minimum 10ft):\n- A creature ends its turn closer to you than at the start of its turn\n- A creature spots you while you were hidden\n- A creature targets you with an attack or spell\n\nOnce you use this feature, you cannot use it again until you finish a short or long rest, or you roll for initiative."
                },
                {
                    "name": "Gate crawler",
                    "lvl": "6",
                    "shorttxt": "Travel past teleportation traces inside of 120ft and no older than a day. \n d20+prof vs 12 + spell lvl - count = prof mod. \n Others can join you equel to the number of flux jumps left.",
                    "desc": "At 6th level, you gain the ability to detect the traces left by teleportation. As an action, you detect the distance and direction to any traces within 120 feet of you. However, if magic obscures any details of a portal or if the trace is older than a day, this feature doesn’t reveal them. If a trace is found, using the flux warriors weapon they can make a check plus proficiency mod to reopen or utilize the the trace. The DC to do this is based on the the level of the spell used.(12 + spell level) this can be done as many times equal to prof mod. Others can come with you through the trace equal to the number of flux jump charges."
                },
                {
                    "name": "Blink Strike",
                    "lvl": "10",
                    "shorttxt": "On attack, 10 feet tp.\n If 2 enemys are hit then hit a 3rd",
                    "desc": "At 10th level, you gain the ability to pass between the planes in the blink of an eye.\nWhen you take the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.\nIf you attack at least two different creatures with the action, you can make one additional attack with it against a third creature."
                },
                {
                    "name": "Nope Step",
                    "lvl": "14",
                    "shorttxt": "Reaction to being hit: tp 60ft and invisible.\nInvisiblity lasts till end of next turn or you attack. \nRecharged on short rest.",
                    "desc": "At 14th level, you have the ability to slip away from your foes. Immediately after you are hit by an attack, you can use your reaction to turn invisible and teleport up to 60 feet to a spot you can see. You remain invisible until the end of your next turn or until you attack, deal damage, or force a creature to make a saving throw. Once you use this feature, you must finish a short or long rest before you can use it again."
                }
            ]
        },
        "feats": [
            {
                "name": "Prodigy",
                "shorttxt": "Adv.. on Constitution saving throws.\nSomatic components with shield/weapons.\nReaction to cast a spell.",
                "desc": "You have a knack for learning new things. You gain the following benefits:\n- You gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.\n- Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus."
            }
        ],
        "racialtraits": [
            {
                "name": "Breath Weapon",
                "shorttxt": "",
                "desc": "When taking the Attack action breath weapon can replace one of the attacks. Damage and save connected to Draconic Ancestry. DC 8+Con+Prof bonus. 2d8 damage on a failed save, and half as much on a successful one. Increases to 3d8 at lv 6, 4d8 at lv 11 and 5d8 at lv 16. Can use a number of times equal to Prof bonus."
            },
            {
                "name": "Fascinated by Mortals",
                "shorttxt": "",
                "desc": "Proficiency in History."
            },
            {
                "name": "Dragonic aspect - 1/day",
                "shorttxt": "",
                "desc": "40ft fly speed. Size increase to large. Tail sweep to hit str+prof 2d8. on large or smaller enemy DC 8+Prof+str or creature is knocked prone. +2d8 cold damage on melee weapon attacks"
            }
        ],
        "other": [
            {
                "name": "Eldritch Mind",
                "desc": "You have advantage on Constitution saving throws that you make to maintain your concentration."
            },
            {
                "name": "Agonizing Blast",
                "desc": "When you cast eldritch blast, add +5 to the damage it deals on a hit."
            },
            {
                "name": "Repelling Blast",
                "desc": "When you hit a creature with eldritch blast, you can push the creature up to 10 feet away from you in a straight line."
            },
            {
                "name": "Mask of Many Faces",
                "desc": "You can cast disguise self at will, without expending a spell slot."
            },
            {
                "name": "Beast Speech",
                "desc": "You can cast speak with animals at will, without expending a spell slot."
            },
            {
                "name": "Armor of Shadows",
                "desc": "You gain a bonus to your AC equal to half your proficiency modifier in this class(rounded down) while you are holding your spellcasting focus."
            },
            {
                "name": "Warlock’s Ire",
                "desc": "All attack rolls against a creature affected by your Warlock’s Curse gain a 1d4 bonus."
            }
        ]
    }
}
